[
 {
 "id":0,
 "name":"Birthday Card 2018 Alyssa Fan 1",
 "quote":"We love you and will miss you so much <3 There might be times when we feel lonely , but know that we are ALWAYS connected at heart <3"
 },
 {
 "id":1,
 "name":"Birthday Card 2018 Yaerin Wallenberger",
 "quote":"Ed,\nThank you so much for everything you've done for me this year. You made my transition into the HS 100x smoother! YOu have a bright future ahead of you!\n Happy 18th!\n~Yaerin"
 },
 {
 "id":2,
 "name":"Birthday Card 2018 Alyssa Fan 2",
 "quote":"Dear Ed,\nHappy 18th bday!!\nI love you so much and am so grateful I got to know you :) Also thank you for no judging me & still being friends with me even though we became close in the most unusual and weird way :D\nThank you for being a kind, caring, and approachable friend.\nI wish you a very happy future and believe that you will overcome any and all hardships. I believe in you!\nEverything is okay, and if it doesn't feel okay, that's okay too <3 :)\nLove,\nAly"
 },
 {
 "id":3,
 "name":"Birthday Card 2018 Clara Kim",
 "quote":"Dear Bernard ;)\nHello!!!! Happy Birthday! I want to thank you for being one of the kindest person I know in my life and for always listening to me and making me laugh during Interim.\nLove you and have fun in College!\nClara K. <3"
 },
 {
 "id":4,
 "name":"Birthday Card 2018 Shloka Bahuguna",
 "quote":"Hi Bernard!! <3\nHappy fricken birthday! You're so old now. smh. Thanks for being literally the nicest person.\nI love you so much<3\nI'm gonna miss you so much next year, wish you were here w/ me next year to deal w/ me :(\n anyways, happy birthday again, have a great day, you deserve it <3\n-Shloki Bloki<3<3"
 },
 {
 "id":5,
 "name":"Birthday Card 2018 Shikaar Maharaj",
 "quote":"Brother <3\n(Ignore the retarded heart)\nI love you!!! so so much Ed, I know I say it all the time, but I have no idea where or who I'd be without you man. You've been with me through so so much & through it all, you've always been on my side & more importantly, by my side. I love you. Happy birthday <3"
 },
 {
 "id":6,
 "name":"Birthday Card 2018 Joy Chan",
 "quote":"Ed!!!!!\nI <3 u, you've been so awesome and I'm so grateful for your kindness that you have for EVERYONE DAILY!!\n<3<3<3\nHave a sick year and keep in touch\n-from Joy"
 },
 {
 "id":7,
 "name":"Birthday Card 2018 Kaitlyn Ho",
 "quote":"Happy birthday!\nThank you so much for listening to all my problems and trying to solve all of them. I really appreciate everything that you have done for me especially making Interim extremely fun. I'll miss you so much but hopefully you'll have a good time in college. Remember to always text me and that you can always end poverty with a simple high five . Also don't do heroin because dad won't listen to you. There are better ways of coping. <3\nKaitelyn"
 },
 {
 "id":8,
 "name":"Birthday Card 2018 Denise Chow",
 "quote":"Happy birthday Edward!\nThanks for a great time on Interim. You are the best! Love you and have fun in College!!\n-Denise"
 },
 {
 "id":9,
 "name":"Birthday Card 2018 Isabella Munder",
 "quote":"Dear Ed,\nHappy birthday!\nI am so glad I have gotten to know you, you are such a kind, caring, funny person and one of the best seniors. Thanks for always saying hi & just being you. Hope you had an amazing day! Don't miss me too much in college. (Jokes)\nfrom,\nIsabella :)"
 },
 {
 "id":10,
 "name":"Birthday Card 2018 Kathy Tse",
 "quote":"EDWARD :)\nHAPPY BIRTHDAY!\nThanks for always being there for us. I'm gonna miss you so much. Pls stay in touch!!\n~Kat"
 },
 {
 "id":11,
 "name":"Birthday Card 2018 Cosima Lesca",
 "quote":"HAPPY BIRTHDAY!\nSo thankful for our unique friendship :)\nYou are so freaking kind and funny and hope you have the best day ever. Gonna miss you a ton next year, but I know, no matter your concerns about leaving, you'll have a fantastic time <3 <3 <3 \n -Cosima"
 },
 {
 "id":12,
 "name":"Birthday Card 2018 Christine Lee",
 "quote":"Dear big brother,\nHappy 18th birthday! Thank you for being there for me for the past 7 (I think) years. You've constantly reminded me that life is worth living. I'm literally about to tear up while writing this but, I love you! <3\n-Your younger <3 sister, Chrissy"
 },
 {
 "id":13,
 "name":"Birthday Card 2018 Alyssa Fan Personal",
 "quote":"Happy 18th Ed!\nI hope you have an amazing day surrounded by your loved one <3\nI'm so thankful we got to know each other and spend a few months together as friends :)\nAlso sorry for the terrible, plain, thin, white A4 paper I used for your bday messages...I hope it made you happy though!\nI know you're going to miss HK, your family, and all of your friends, but what's ahead of you is also as amazing<3\nAlso i know we kind of drifted, but I hope you know that I still love and care about you. I'm always here if you need me and I'll work on my listening skills....ha\n On that note, I hope you have a very happy day & keep smiling because your smile makes me happy <3\n\nNamaste,\nAlyssa"
 },
 {
 "id":14,
 "name":"Birthday Card 2017 Theresa Ho",
 "quote":"Happy (late) birthday CakED!!\nThanks for always being a spark in my day and also for being so understanding. LOVE YOU and never change who you are \n-Tree\nP.S. Hope you ate cake and hope we surprised you!!!"
 },
 {
 "id":15,
 "name":"Birthday Card 2017 Eric Lee",
 "quote":"Happy (late) Birthday Ed!\nTHanks for supporting me for all the time. I'm so glad that I got to know you! I hope I get closer to you from now on. Let's have fun during summer and get ready for senior year! I hope you like our surprise thing. I love you and again, happy birthday!\n-Dong"
 },
 {
 "id":16,
 "name":"Birthday Card 2017 Vedika Vishweshwar",
 "quote":"HAPPY BIRTHDAY ED!\nI'm so happy I got to know you this year and make so many memories w/ you, it's been a great ride! Hope you enjoyed the TOUP chat surprise :)\n-Vedika"
 },
 {
 "id":17,
 "name":"Birthday Card 2017 Shikaar Maharaj",
 "quote":"I LOVE YOU BROTHER <3\nWe send each other enough soppy texts, but I mean it. I don't know who I'd be without you in my life."
 },
 {
 "id":18,
 "name":"Birthday Card 2017 Christie Chan",
 "quote":"Hey :)\nHappy belated birthday Ed!\nWe all know it might be super late to celebrate this but better late than never right!?\nThanks for the awesome year and hope you like our surprise!!\nEnjoy :)\n-Christie"
 },
 {
 "id":19,
 "name":"Birthday Note: Kathy Tse",
 "quote":"EDWARD!!!! HBD!\n ahh I'm so gonna miss you so so much when you leave this year :( Even though we just met towards the end of last year, it feels like we've been friends for a really long time <3 \n \n Thanks for talking ot us even though our table is really loud and pretty annoying HAHA\nGood luck with everything and pls stay in touch and snap me anytime. We will meet up again and I wish you the best <3 I'm gonna miss you so so freaking much!\n-Kat"
 },
 {
 "id":20,
 "name":"Random Note: Alyssa Fan",
 "quote":"Dear awareness bottled up in a meat body :) \n Hope this makes you happy! Also thank you so much for everything over the holiday:) \nFromt weirdo"
 },
 {
 "id":21,
 "name":"Graduation Note: Mrs. Chi",
 "quote":"Dear Edward,\nCongratulations on finishing a great High School career! Thank you so much for letting me be a part of your journey. I feel so blessed ot have our relationship. You sinspire me with your deep genuine care for all th epeople in your life. Man, SF is so lucky to have you! Please stay in touch. :) \nBest, Mrs. Chi"
 },
 {
 "id":22,
 "name":"Christine Lee Cards - 18th Birthday",
 "quote":"So if you have opened this envelope and proceeded to reading this letter then...YOU ARE LEGAL!!!\nYou are now 18 years old! I'm so happy + lucky to have known you for 1/2 of those 18 years. It's a shame that we've just become to get closer from only last year. You've helped me through thick and thin and I couldn't have been luckier to be your little sister. I know I've started to say this a lot now but, \n1) idk what I'm going to do without you\n2)I'm gonna miss you like crazy\n3)I'm gonna cry so hard on the last day of school\n4)I love you <3 so much.\nBefore I close this off, I just wanted to say Happy birthday<3\n5)I'm really lucky that I'm your sister."
 },
 {
 "id":23,
 "name":"Christine Lee Cards - Graduation",
 "quote":"Dear big brother,\nCONGRATULATIONS!!It is finally the day of your graduation from HKIS! Your journey at HKIS may have ended but your journey into the world is just starting to begin. You may or may not be wondering what the purpose of this letter is (idk...up to you) and honestly, idk either. This letter will probably be me just ranting about how grateful I am to have you as an older brother. First of all, I would like to say thank you! Not only for being there for me for the past couple of years, but for also taking care of me. Words can't explain how grateful I am for such a considerate, supportive, and caring older brother.\n*Disclaimer:This letter will have no order/type of organisation whatsoever so this will be a mess but you're used to that as you have been dealing with me for a while.\n\nWe've known of each other's existence for 9 years (so since I was 7? idk) but we've gotten closer over the last two, which I feel is sad. Honestly, I don't know how you've dealt with me and my problems for so long because there is a lot, some of which are very much repeated...actually, all of them are very much repeated, so kudos to you<<3 I also don't know how you've managed to come to basically all of my performances in the past two years. You've really encouraged me to continue performing and helping me to remember to BREATHE!\n\nYou help me feel needed and loved when I needed to the most. (I can't English...but that's nothing new). You've constantly reminded me that I have a reason to live for the long period of time that I've known you for, you've constantly made sure that I was doing okay. You've helped so many people and you deserve all the recognition that you get, I'm gonna end this letter here by saying a couple of words.\n\n-I'm gonna miss you like crazy\n-idk what I'm gonna do w/o you\n-I'm so lucky to call you my older brother\nand finally...I love you more than words can say and CONGRATULATIONS! You've achieved (idk if that's right) so much and I don't want you to give up! <3"
 },
 {
 "id":24,
 "name":"Christine Lee Cards - Love",
 "quote":"I love you so incredibly much and I'm so thankful that you've been here and there for me. You've supported every decision I've made, which I know is extremely hard but you make it work. I honestly love you so so so so so much that I can't even explain it using words. I LOVE YOU SO MUCH <3"
 },
 {
 "id":25,
 "name":"Yearbook 2018 – Melanie Chan",
 "quote":"Dear Edward,\nThanks for being such a good friend and looking out for us!!\n~Mel! <3"
 },
 {
 "id":26,
 "name":"Yearbook 2018 – Serena Tam",
 "quote":"Ed!!I'm so glad we survived Gill^2 this year. It was... an experience. Thank you for 4 years of poking me & patting my head. Good luck in College :)\n~Serena Tam"
 },
 {
 "id":27,
 "name":"Yearbook 2018 - Kaitlyn Ho",
 "quote":"Dear Edward,\nI wrote a lot on your b-day card and I'm kind of lazy but in summary I love you so much! Thank you for always being there to listen to my problems and look out for me. I really appreciate it. I'm so glad that we got to meet over Interim and had a lot of bants. (Let's end poverty & double check that our phones are waterproof or start doing heroin because dad is neglecting us). All in all, I'm going to miss you and your bubbly personality that never fails to make me laugh! <3 I'll miss you so much, have fun in college! Snap me :)\n-Kaitlyn Ho <3 <3"
 },
 {
 "id":28,
 "name":"Yearbook 2018 – Katelyn Liu",
 "quote":"Edward!\nDespite never being able to shut up, words can't even begin to describe what a humble, kind, funny, supportive, etc etc person you are! I'm so lucky to have met you these past couple weeks and to be able to talk to you about anything. I really do wish I got to meet you sooner, but we'll definitely keep in touch ;) BEST OF LUCK!!\n <3 Love ya lots <3,\nKatelyn"
 },
 {
 "id":29,
 "name":"Yearbook 2018 – Gabi Vardanega",
 "quote":"Dear Edward,\nWords can't even describe not only how thankful but also how glad I am to have you in my life. You have such an amazing soul, I've never met anyone like you. You have constantly encouraged me to become a better person and I'm so thankful. You have changed my life more than anyone ever has. Please don't ever stop being a beautiful soul. I love you so much. Our friendship began so long ago, yet I'm so grateful for the endless bus rides & support you have given me. What am I going to do without you? I can't wait to hear about all the amazing things you'll do in your life. You have constantly reminded me that there is hope for humanity. Keep being the beautifully kind soul that you are, I'll make it my goal to pursue your legacy, so that your kindness will never be forgotten. Once again, thank you. I love you so much, keep me posted <3. Good luck in Uni. Happy day of birth \n<3 - Gabi"
 },
 {
 "id":30,
 "name":"Yearbook 2018 – Zooey Lundgren",
 "quote":"Dear Edward,\nAlthough we've only been in each others lives for a couple of months,  talking to you on the bus ALWAYS makes my day better. You're insightful, genuine, and are nice to any person who engages with you. Unlike many others, you don't seem to care about how popular or good-looking someone is. This is such an amazing quality that will continue to benefit you throughout your life. Good luck at Uni, I know you're gonna accomplish some real cool things! Thanks for the real convos & advice man!\nZooey :)"
 },
 {
 "id":31,
 "name":"Yearbook 2018 – Denise Chow",
 "quote":"Hi Edward,\nI'm going to miss you so so MUCH! Thanks for making interim so fun, I don't know what I'm going to do without you. You're the best & GOOD LUCK WITH COLLEGE!!! <3 \nStay in contact\nLove, Denise"
 },
 {
 "id":32,
 "name":"Yearbook 2018 – Cosima Lesca",
 "quote":"Edward!!!\nOmg just thinking about you leaving is making me saaaaaaad :(. Thanks for being such a great friend!!! Gonna miss you a ton and hope you have an amazing time at Uni!!!\nCosima"
 },
 {
 "id":33,
 "name":"Yearbook 2018 – Liberty Chapman",
 "quote":"Benny Berkenkotter Doppelgänger!\nYou will be missed! Thanks for making me think I was hallucinating 2 Benny twins around! HAVE FUN @ COLLEGE!\n- Liberty"
 },
 {
 "id":34,
 "name":"Yearbook 2018 – Sarah Lau",
 "quote":"Hi Ed!\nI'm so glad I've got to know you over these 4 years! I actually don't remember how we met, you were just always there lol. Have a great life, I will miss you lots! I will meet up with you sometime in the future definitely!!\nLove you <3\n-Sarah"
 },
 {
 "id":35,
 "name":"Yearbook 2018 – Isabella Munder",
 "quote":"Dear Edward,\nI am so glad I have gotten to know you this year! You are so funny, nice, caring, & thanks for all the hellos & pats on the head when you c me. BTW ITS A FLOWER! When you come back I'll draw you another FLOWER just for you XD. Hope you have an amazing time @ San Fran & hope to stay in contact. HAGS <3 Hope college goes well & hope for the best my fake senior,\nIsabella (Izzy <3 xD)"
 },
 {
 "id":36,
 "name":"Yearbook 2018 – ZiQi Liow",
 "quote":"Edward!! I'm gonna miss you so much. Thank you for giving the best advice and helping me throughout middle school. You are one of the kindest and funniest people that I have ever met. Good luck in college!!\n~Zi Qi <3 <3"
 },
 {
 "id":37,
 "name":"Yearbook 2018 – Oliver Cheung",
 "quote":"Dear Edward,\nThank you so much for always being there for me. You do not understand how much you mean to me. I will miss you so much next year. Good luck in College!\n- Oliver"
 },
 {
 "id":38,
 "name":"Yearbook 2018 – Adrian Tang",
 "quote":"Edward\nThank you so much for everything!!! I wish you good luck on the future whatever you're doing.\nVisit me in SFO, I'll be at East Bay tho lol.\nAdrian"
 },
 {
 "id":39,
 "name":"Yearbook 2018 – Christine Lee",
 "quote":"Dear big brother,\nI can't believe that I've known you for 10 years...You've dealt with me for so long, so well done. I know it's not always (or ever) easy to deal with my MANY and REPETITIVE problems. You've dealt with my issues for so long that I don't know how you did it. If I write anymore, Imma cry. You are opening another one of my letters in a couple of days. LOVE YOU <3 You may or may not be receiving many rants + memes + more; in the future so just a lil warning."
 },
 {
 "id":40,
 "name":"Yearbook 2018 – Archit Kumar Srivastava",
 "quote":"Dear Edward!\nI am so happy that you were in my Comp Sci class last year. It was so fun, and in i2p where I was grinding CSGO. I am so happy to know that you are pursuing Comp Sci and I can't wait to get some brain cells and work with you. I really want to stay in touch and meet up after a while so we can dick around again. I wish you the best of luck in future.\n- Love you more,\nArchit Kumar"
 },
 {
 "id":41,
 "name":"Yearbook 2018 – Hamlet Lin",
 "quote":"Hey Edward,\nIt's crazy to see this moment coming. You are graduating. We are actually from the same cohort. I'm so glad to have you in my class. You totally took what you learnt to the next level. I really appreciate your honesty & natural, authentic, curiosity & passion to learn. Keep the fire going & remember to drop by our classroom when you come to visit!\n Mr. Lin"
 },
 {
 "id":42,
 "name":"Yearbook 2018 – Vanessa Cheung",
 "quote":"ED!\nWe've been close for like... 2-3 years and I'm soooo thankful I got to share so many memories in HS with you. Thanks for being the most understanding & supportive friend and for dealing with my craziness. I'll never forget our four hour Skype calls & long post-dinner hangouts. I really hope we stay in touch cuz I think we both know how empty our lives will be without each other. I WILL invite you to my house SOMETIME dw. Love you bro :)\nVanessa Cheung <3"
 },
 {
 "id":43,
 "name":"Yearbook 2018 – Andrea Pun",
 "quote":"Edward!\nIt's been a wild ride in JEng and SEng, but hilarious times when we'd make eye contact after particular people would say dumb things. *cough*. Thanks for being the friend who supported me when I didn't know what was going on in class and not being able to see the board. :)\n-Andi"
 },
 {
 "id":44,
 "name":"Yearbook 2018 – Theresa Ho",
 "quote":"TOUP! VALT-FREE ZONE:\n\ncakED\nThanks for being such a great friend for 4(?)+ years. Even though we've had phases and haven't always been close, ik we are now & hope you know I'll always be here for you. Thanks for all the work lunch dates over summer, BBTS @ SHARETEA in cwb w/ tree, Hysan food court memories, TOUP & treeza-shikrr-dong-ed-vedik dinners, movies & fun times. It's been so fun & I don't think I'm quite ready to let it all go. ik you'll do amazing things in San Fran.\nCome visit me in London OR Toronto (?) & let's meet up during breaks. \nKeep in touch & Lots of love,\nTREE <3"
 },
 {
 "id":45,
 "name":"Messenger Chat Vanessa Cheung 1",
 "quote":"Awwww ed I love u so much <3 <3 <3 I'm so sorry about yesterday I was honestly so done as well and I was rly petty and dramatic. Ur like my brother and I care about u so much. Even if I don't show it, I love u so much and I will always be here for u. I'm sorry I was such a bitch yesterday but I was actually irritated. It was rly stupid tho. I hate fighting with u cuz it honestly makes me feel so sad not being able to talk to u. I love talking to u so much (more than any of my other friends tbh) cuz u always r there for me and I can tell u anything :)"
 },
 {
 "id":46,
 "name":"Messenger Chat Vanessa Cheung 2",
 "quote":"Ur honestly like my brother and I'm so happy we r so close :) rmb that u can tell me anything. Once again sorry about last night that was definitely me overreacting (as usual) but I'm so glad I decided to apologise and found out how stupid I was. I hate fighting with anyone but esp u cuz my life feels empty without u. Ur also actually the best thing that's happened to me in HS cuz u rly r such an amazing friend <3 ilysm ed :) thanks for making my life so much better I truly mean it."
 },
 {
 "id":47,
 "name":"Messenger Chat Vanessa Cheung 3",
 "quote":"Ed....I don't even know what to say.... I know I was rly pissed off today but I rly shudnt have overreacted that much. I just got pissed cuz I felt sorta rejected when u changed ur dp idk why.... it just made me feel replaced I guess cuz I thought it was like saying u preferred Christie over me as a friend and I know I shudnt think that way but yeah.... I'm rly sorry for being sucha  bitch but I just wanted to let u see my side...and also when u told tree I got rly mad cuz i don't want ppl to know that we r fighting it's like our private argument and ppl don't needa know about it but I guess it's okay it's not like she'll tell everyone...I'm so embarrassed cuz I'm so fucking dramatic so I'm rly sorry and it's ok if u don't wanna talk to me for a few days. I understand cuz I know I'm such a pain to deal with I'm always so dramatic but that's just who I am. And I know I rly don't appreciate u enough but I rly am so thankful to have u in my life. "
 },
 {
 "id":48,
 "name":"Messenger Chat Vanessa Cheung 4",
 "quote":"awww ed thank you so much <3 I really don't know what I wu do without you. You are literally my biggest supporter and I'm yours too. Thanks so much for everything I really mean it. Thanks so much for helping me out when I need it and for making me come to my senses. I really do mean it when I say I can't live without you. I don't know what I would do without you to be completely honest. You are the most real person ever-unlike my fake ass bitchy friends-and I'm so thankful for you. I need to find myself and I'll try my best but I might not be as successful as you. "
 },
 {
 "id":49,
 "name":"Messenger Chat Vanessa Cheung 5",
 "quote":"AWWW ED I LOVE THIS! THIS IS SO SWEET I LOVE U SO MUCH <3<3<3 thanks SO MUCH  for EVERYTHING I honestly mean it. Idk what I wud do without u. Uve ALWAYS been here for me no matter what and I'll always be here for u too. I can't imagine my life without u, and I love how we chat/snap every day and how we Skype every month even tho we don't see each other in school everyday. We r truly best friend goals. Even tho u can be hella sensitive sometimes, ur so caring and I love that u care so much about others. Even tho we r so opposite, we still manage to be best best best friends and I couldn't be happier about that :) thanks for making my year amazing too ed. If I hadn't met u, my life wud be so different rn. Thanks for being such a huge part of my life. I LOVE U SO MUCH TOO ED <3"
 },
 {
 "id":50,
 "name":"Messenger Chat Vanessa Cheung 6",
 "quote":"AW ED ILYSM!! I rly mean it. Thanks so much for everything. Thanks for always sticking by my side even when I'm soooo stubborn and rude. Thanks for always helping me out and keeping my secrets. I know for sure that u r a better friend than I am, and I appreciate u so much :) these past few days have been rough, and I'm sorry for being such a bitch (I was reading our convos and I was like wtf was wrong with me) but I have my mood swings and we can move past it. Ur so caring, kind, and selfless and even though we are SUPER opposite, we still manage to work :) I wud never wanna lose u as a friend, and idk why I kept suggesting it yesterday but now I realise hwo irrational I was. Sometimes I say things that I don't mean because I let my emotions take over, and you know that. This year has been soooo much fun with u and i'm so glad we r best friend goals. Thanks for making this year so amazing. You're probably my closest friend at hkis and I'm so happy that you are. I love u so much too and I'll always be here for u. Don't be afraid to tell me anything even if I act like a bitch sometimes cuz I'm always here for u and that's what best friends are for <3"
 },
 {
 "id":51,
 "name":"Messenger Chat Vanessa Cheung 7",
 "quote":"Thanks so much for being such an amazing best friend AND bro ed!! Ily so much too. So so happy we met in 7th grade and that we stuck as friends and grew even closer over the years. I'm so glad that we chat and snap everyday and that we have Skype calls sorta often (even tho we need one soon)! Thanks for everything."
 },
 {
 "id":52,
 "name":"Messenger Chat Vanessa Cheung 8",
 "quote":"Awww ed :) I also would have never guessed that our friendship would be where it is now. I'm so glad we started getting closer since sophomore year cuz you're such a huge part of my life. Ur my go to person and I literally tell u so much. I trust you with my life, I know you'll never give up on me. I'll always be here for you too and even if I say I'll give up on you, I don't mean it. Thanks so much for everything Ed <3 <3 I know we'll still be able to be very close friends even in college cuz our friendship is so strong and we have come so far :)"
 },
 {
 "id":53,
 "name":"Messenger Chat Vanessa Cheung 9",
 "quote":"I love u so much ed <3 ur the most caring person ik and ur such an amazing best friend. Really am so thankful for u even tho I might not show it all the time. Thanks for everything ed"
 },
 {
 "id":54,
 "name":"Messenger Chat Vanessa Cheung 10",
 "quote":"Awwww ed I love u so much :) <3 Seriously thanks for everything. Ur actually like the best cuz ur so caring and kind to even ppl u don't even know or like. Yes we are polar opposites but I guess that's what draws us closer together. Love u so much too ed <3 <3"
 },
 {
 "id":55,
 "name":"Messenger Chat Vanessa Cheung 11",
 "quote":"Thanks so much Ed:)This actually means a lot to me, considering how sad I was earlier. Thanks for always listening to my depressing rants and for taking all the insults and all of my bs. Thanks for always making time for me to talk to me and help me out. I really appreciate it, especially now since I'm low-key depressed and always crying. Thanks a lot for everythingEd. Ur my best friend too-that's why I tell you everything. I trust you with my life and I know you'll always be there for me so thank you so much <3"
 },
 {
 "id":56,
 "name":"Messenger Chat Vanessa Cheung 12",
 "quote":"Thanks for being such an amazing friend ed. I really mean it. I know I can be a huge bitch sometimes but I just wanted you to know that you mean a lot to me and that I actually cannot live without you. Even though I am mean to you sometimes, I never really mean it cuz I always let my emotions take over. Thanks for keeping me sane ( or at least LESS insane) these past few years and I'm very thankful for our amazing friendship :) Hope you had an amazing day today <3 <3"
 },
 {
 "id":57,
 "name":"Messenger Chat Vanessa Cheung 13",
 "quote":"Wowww ed omg I didn't expect this haha sorry for this super late reply I just woke up. Ilysm Ed. Thanks for always being my biggest supporter and even tho I snap at you A LOT, I don't always mean everything I say. I know I get salty about some of the smallest things but I guess it's just cuz I've grown so close to you and expect you to give me first priority but I guess that's not always the case. I know I've thought about dying far too many times during AP week, and I literally was considering it cuz I was just so done and couldn't handle it. I appreciate all the times you have pulled me out and have spent calling me even tho you could have been studying. Thanks for always being my best friend and for talking to me when I need it, I really appreciate our friendship :) <3"
 },
 {
 "id":58,
 "name":"Messenger Chat Vanessa Cheung 14",
 "quote":"wow ed, I was not expecting this. I mean you've always been one of my closest friends and I know we don't feel the same way abou teach other, but I love having you as a best friend/brother so much. Sorry this reply may be short cuz I'm in chinese right now, but I really do appreciate you too and I hope that we will still stay close in college cuz idk what I would do without you either."
 },
 {
 "id":59,
 "name":"Messenger Chat Vanessa Cheung 15",
 "quote":"Hey ed, i know I may not be the most supportive/encouraging friend but I just wanted to let you know that I'm always here for you. I will admit I don't understand what you're going through because it's never personally happened to me. I can't even imagine how hard it must be. Sorry if I'm not much help, but I'll always be here to listen. You're one of my best friends and you're such an amazing person. I know I don't really send these messages but I thought you should know. Thanks for literally being one of my biggest supporters, for listening to my problems, for encouraging me to keep on going even though I wanted to give up, and just for everything. I hope you also find that I help you through tough times too because I really do try. Anyway, just wanted to say I'm very grateful for our friendship and can't believe we've come this far. Love you ed"
 },
 {
 "id":60,
 "name":"Messenger Chat Vanessa Cheung 16",
 "quote":"Omg ed ilysm <3 <3 <3 honestly, if we weren't friends in High School, I would have been a totally different person. Even though we are totally opposite, we still are best friends because we know we need each other. Thank you so much for always being there for me, especially in really desperate situations, and for sticking with me even if I may be the meanest person ever. You're so caring and honestly a much better friend than I am, but I'm glad I am still an amazing best friend to you too :)"
 },
 {
 "id":61,
 "name":"Messenger Chat Vanessa Cheugn 17",
 "quote":"Yeah it's actually funny how we felt the same. I guess it's because we're so close, beyond just friends, that we definitely don't want anyone to replace each other. Bu tour friendship is different from the one I have with Bert and the one you have with your interim friends. Thanks for making my High School experience experience so memorable as well. We need to create more memories the last few months we have together because who knows when we'll see each other again once we go to college. Anyway have fun in Samui, tell me all about it! I love you too Ed <3 thanks for always being an amazing best friend"
 },
 {
 "id":62,
 "name":"Messenger Chat Christie Chan 1",
 "quote":"I am actually really thankful for you supporting me since we've met, and even though I don't say these things and express these things as much, one of the reasons I can still accept going to school is because I know there is still ppl like you that actually supports me and is there for me when I need help. Don't feel like you are alone, you can always trust me like how I trusted you. You are loved you know. And TBH I should be more thankful that you are actually helping me so much and listen to all the stupid things and thoughts I say, so if you need any help you can always find me."
 },
 {
 "id":63,
 "name":"Messenger Chat Christie Chan 2",
 "quote":"Awww thank you so much ed! Honestly idk how I will do without you this year. Thank you so much for always being there for me and support me for so long. Wish you'll have a better year in 2017 and see you soon M3"
 },
 {
 "id":64,
 "name":"Messenger Chat Christie Chan 3",
 "quote":"Thank you so much ed:) honestly I'm really thankful for having you as one of my best friends :) you are so caring and kind to me all the time and I'm truly thankful for you :) I will try to stay more positive now and I'll certainly find you when I need help :) Love your thoughtful message so much :)"
 },
 {
 "id":65,
 "name":"Messenger Chat Christie Chan 4",
 "quote":"You are a really really great friend of mine, you're always so encouraging and your positivity always makes my day:) Stay strong ed we're always here for you \n There will always be sad moments in life and death is inevitable but I'm sure she'll be proud of you :)"
 },
 {
 "id":66,
 "name":"Messenger Chat Christie Chan 5",
 "quote":"Thank you so much too ed :)<3<3<3\nI am actually really thankful for all the times you've cheered me up through my hard times and bear with me. I'm sorry for not keeping up with chats but thanks for still believing our friendship and keep this going :)<3\nAlso it turns out that I don't have to work lol"
 },
 {
 "id":67,
 "name":"Messenger Chat Christie Chan 6",
 "quote":"Awww\nThank you so much ed<3 you have no idea how much you've helped me and been there for me for these past three years, also sorry for always not replying and not spending much time iwth you, even tho I didn't spend much time tbh, you give me a lot of strength and I'm so grateful to know you<3\nStay Strong, I'll always be there for you"
 },
 {
 "id":68,
 "name":"Messenger Chat Gabi Vardanega 1",
 "quote":"AW ED OMFG I love this so much :) :) <3 <3 thank you so much for being such a great friend which was basically my brother last year! I don't know what I would do without you in my life :) thank you so much for being my anchor which constantly reminds me of the good things in life :) You're one of the best people I've ever met and I'm so glad I can call you my friend <3 can't wait for more adventures to come! ILY <3"
 },
 {
 "id":69,
 "name":"Messenger Chat Gabi Vardanega 2",
 "quote":"I have known Edward for over 3 years now. Through the years, he has not only become one of my best friends but has also become my role model. Whenever I have a problem, I always know that he’ll be there for me to listen and give me advice. Even when he is busy, he makes time to help me with my problems. He has become such a strong support system for myself, and many others, that the bond between us has become something like that of siblings. \nAlthough I’ve met many people throughout they years, no one compares to Edward. That is why he has become a role model for myself.\nHis love for people is something I envy. I still don’t understand how someone can be so compassionate. Being there for people in a supportive way is what Edward does better than anyone I have ever met. \n\nEdward always goes out of his way to help others even when he is facing challenges of his own. He puts others in front of himself because he is always seeking to lessen the pain of others.\nEdward is the perfect applicant. I am sure he will greatly benefit the program and community to the best of his abilities."
 },
 {
 "id":70,
 "name":"Messenger Chat Theresa Ho 1",
 "quote":"awww eddd thanks for everything !! tbh ur truly such a good person. rip our streak ended but i'm glad we got close again this year :) ALWAYS HERE FOR YOU TOO"
 },
 {
 "id":71,
 "name":"Messenger Chat Theresa Ho 2",
 "quote":"Aww edddd this is sweet :')) thank you so much too!! On prom night, I really learned a lot about you and everyone and I'm so grateful tbh that i have good ppl like you guys as friends <3<3 Imma always be here for you no matter what."
 },
 {
 "id":72,
 "name":"Messenger Chat Theresa Ho 3",
 "quote":"omgomgomg\ned just want to say, I have so much respect for you, for putting with so much shit from everyone. Just know that no matter what, how little or how much you do, I'm never gonna turn on you or shit on you or use you. Like you're genuinely one of my closest friends and I know you hate how things sometimes just don't go as planned because you do so much, but that's jus tlife and we have to accept it. Things happen and things are unpredictable, it's hard I know, but that's what makes you an amazing person, because you never give up, which is such a strong character trait because so many people just don't give a shit about anyone"
 },
 {
 "id":73,
 "name":"Messenger Chat Jessica Tan 1",
 "quote":"Awww thanks so so much ed, haha how am I supposed to beat the essay you've written this time! Honestly thank you so much for always being there for me... I truly am so so grateful -- you're practically the only person I know who I can count on 100% of the time. I'm so so so glad that we're friends and don't know what I would do without you. Seriously, I don't know anyone more compassionate, caring, or as sweet as u are. Have an amazing new year! Love u too!"
 },
 {
 "id":74,
 "name":"Messenger Chat Jessica Tan 2",
 "quote":"Honestly I absolutely cannot thank you enough for being such a genuine person. I know I've done some shitty things to you in the past, but honestly, I respect you and admire you more than anyone else. You seriously are one of the best people to walk planet Earth, and though its completely cliche, I can't thank you enough for everything that you've done for me."
 },
 {
 "id":75,
 "name":"Messenger Chat Alyssa Fan 1",
 "quote":"Thank you <3 wow, I am so lucky and grateful to have you as a friend. I don't know how to put into words but thank you so much for all you have done for me up to now. And yes, we both live outside of time ;) :) But really, I'm genuinely so so happy we became friends and it's honestly one of the best and genuine relationships I've ever had. Thank you for having deep conversations with me and thank you for connecting with me. (I never wrote anything this deep until I met you haha). Also I never imagined to find and become friends with someone super caring and genuine and honest as you are. You mean so much to me and I don't know if I'll be any of a support, but I will also always support you and wish you the best at spirit. I mean it <3 Also isn't it just so interesting how we became friends? Lol, I just randomly texted you because for some reason I trusted you even though we didn't know each other that well. And you, super duper kind and amazing, listened to me and helped me even when you were going through some tough times. Wow. Ahhh I can write a whole essay about how thankful I am but we also live inside of time hehe so I'm going to stop there for now <3 <3"
 },
 {
 "id":76,
 "name":"New Year's Message Christie Chan 2017-18",
 "quote":"Happy new year Ed<3\n These years have been crazy with you, we have been through so much and I'm so thankful to have you with me through all those hard times <3 thank you for being such a great listener and giving me such great advice <3 happy 2018"
 },
 {
 "id":77,
 "name":"New Year's Message Ashlyn Silva 2017-18",
 "quote":"HAHA It's not New Years for me yet but idc. LOVE YOU ED. Senior project is gonna be fun cause we haven't really worked in a big project together. Love those homeroom ranks and cringe moments. LOVE YOU. WE ARE GONNA KEEP IN TOUCH DURING COLLEGE"
 },
 {
 "id":78,
 "name":"New Year's Message Jessica Tan 2017-18",
 "quote":"AWWW THANKS PENGUIN\nahhh why you gotta get that paragraph pre written there's no way I could text ot catch up :( but HAPPY NEW YEARS\nThank you so so much fo ralways being here for me, regardless of how crazy and 'special' I am <3 <3 <3 so so so SO glad we became friends and have stayed friends through all these years <3 I would roast you but it's New Years so you're off the hook (for now) JKJK ily so so much and hope that this year is one of the best ones for you, full of happiness, laughter, discover, and fun. \nLove you ed<3"
 },
 {
 "id":79,
 "name":"New Year's Message Jane Lee 2017-18",
 "quote":"uh I'm not crying :3, edward, i prob wouldn't have made it to HS without you to be honest, and I'm super thankful that you've been there with me every step of the way. :) I know I can be a bitch <3 but I only really want what's best for you and to be right because I'm me but anyway HAPPY 2018!! \nSuper excited and sad about the last semester we're spending together at HS. Wherever you go, I'll know you'll find great friends and be amazing :) dw I won't forget you\n^^HAPPY NEW YEAR ED"
 },
 {
 "id":80,
 "name":"New Year's Message Katy O'Sullivan 2017-18",
 "quote":"Thank you so much Edward for writing this. I feel exactly the same about you. You alway sknow how to make my day better, how to cheer me up, how to show there's another way than just moping about the problem and how to let loose because it's not the end of the world. I couldn't have gotten through this semester without you and I genuinely mean that. I'm so glad to have you as my friend. Love you with all my heart Ed! You deserve an amazing 2018. Happy new year <3 <3 <3"
 },
 {
 "id":81,
 "name":"New Year's Message Kirsten Luk 2017-18",
 "quote":"EDDD!!! OMG what a surprise! I can't believe it's been so long!!! It's been really fun n I'm really glad I'm getting to know more of you this year and kind of last year! Believe me you won't be able ot tease about my attendance this year, punctual is gonna be my middle name! I hope you have a great year, and a greater year after that and so on! Happy new year Edwardo (idk if you remember this but I think I used to call you that)"
 },
 {
 "id":82,
 "name":"New Year's Message Nicholas Poon 2017-18",
 "quote":"woah did not expect this ;( thanks so much Ed :) Can't believe 7 years have flown by so quickly. Without you, my love for sailing would have been non-existent, so thank you greatly for that. I love sailing FarrFetched with you and your family :) it is an opportunity I treausre everytime I step on your magnificent boat. After we graduate, I hope this year will not be the last year we sail together! Thanks for the touching message, I would say more if I had more time but Happy New Year my friend :D"
 },
 {
 "id":83,
 "name":"New Year's Message Vanessa Cheung 2017-18",
 "quote":"Thanks so much Ed!! This means so much to me. Thank you so much for always sticking by me no matter how difficult I can be, and for never giving up on me. We definitely need to create new memories this year cuz we are literally going to college so soon! Thanks so much for being such an amazing friend. I love you <3 <3 <3"
 },
 {
 "id":84,
 "name":"New Year's Message Alyssa Fan 1 2017-18",
 "quote":"Ahhhhh I love you so much Ed!!\nOf course it feels like we've known each other for more than a week!!! hehe!! We come from the same planet and we were once neighbors! Duhhhhhh :D <3\nYou are sooo soooo sooo amazing and I'm so grateful to have you as a really close frienddddd hehehehe\nI hope you have an amaaazing 2018 and let's make it a more loving, more caring, more tolerant, more CRAZY, more FUNNY YEAR <3\nThank you thank you thank you so much for being my friend<3<3\nHAPPY NEW YEARRRRR"
 },
 {
 "id":85,
 "name":"New Year's Message Alyssa Fan 2 2017-18",
 "quote":"YOU'RE SO FUNN TO TALK TO HEHEHE WELL MAYBE BECAUSE YOU'RE SO KIND AND YOU REALLY DON'T JUDGE ME <3 I love you so much ahhhhh <3 I'm so thankful fo ryou!! It feels like you're really WITH ME when we talk together you know <3 and that's not something that happens with everything eyet :) \n and also!! Thought you want to hear this,,,, relationship between dad and I is getting sooo much better <3 all thanks to you and your encouragements....couldn't have done it alone <3 <3"
 },
 {
 "id":86,
 "name":"New Year's Message Christine Lee 2017-18",
 "quote":"Aw Ed! You've been there for me through everything and was willing to listen to me rant. You helped me get through all this drama that happened this past year, from boy drama to friend drama. Honestly, I don't know what I'll do when you're gone next year ;( I know it may not be easy to deal with me and my problems but thanks for being there and I know I've said it a lot but I am <3... I got a lot of problems ( sorry this isn't as long as yours ) HAPPY NEW YEAR <3 <3"
 },
 {
 "id":87,
 "name":"New Year's Message Tiffany Chan 2017-18",
 "quote":"I'm pretty bad at these messages but thank you so much for approaching me at HKIS and being one of my only true friends there. Tbh my experience at HKIS wasn't great so thank you for giving me some good memories from my time there. THank you for listening to me rant and being there for me all those times. Happy new year :)"
 },
 {
 "id":88,
 "name":"New Year's Message Shikaar Maharaj 2017-18",
 "quote":"Where do I even begin. It's so sad that we only have a few months of seeing each other every day, but I feel like that's all the more reason to make the best memories that we can. I just want to say thank you for all you've done for me, you've been with me through some rough patches this year, and I couldn't have asked for anyone else by my side. It makes me so happy and so honoured to call myself your brother. Even though I slip now and again, you're always there to listen and help, you're my rock and I can't express how thankful I am to have you in my life. I love you man, I really do. Here's to a new year and a new chapter in our story <3 happy new year!"
 },
 {
 "id":89,
 "name":"Messenger Chat Nicholas Poon 1",
 "quote":"Awww thanks ed. Totally wasn't expecting a message like this. Very touching. It sure is funny how we have become very close even though it was really Geo who introduced me to you. Though maybe it is with good reason. Thanks for hanging with me and watching Rogue One with me too (God damnit Jane). My PC is still named Eick (lul) and I am honoured to be a co-leader of our sailing club :) we should also start on an email for sailing club before we get back."
 },
 {
 "id":90,
 "name":"Messenger Chat Bailee Brown",
 "quote":"Edward!!!!!! This is so nice <3 :( It's been wild that we've both been through th eentire HKIS system together ahahahah. It has been so nice that we finally got to reconnect after so many years and you are so freaking smart and genuine. I just kno wyou're going to do amazing things in life. You've already started creating apps and have the best conversations that a lot of people just can't do. Thank you so much for always supporting me and always seeing th epositives. THank you again for writing this, it literally just made my week!"
 },
 {
 "id":91,
 "name":"Messenger Chat Pallav Panigrahi",
 "quote":"Ed, idk where to start. It's been an absolutely amazing year, although we've both had our share of ups and downs, (although my problems are usually jus tme being dumb I admit.) From Jam sessions, to lunches together, to my post-being drunk rants and calls to you, and esp my dumb decisions at times, you have always been there for me through thick and thin this year, through rain and shine, and I can't thank you enough for that. I know that next year's gonna be very different and it seems scary but knowing that you are with me makes that so much easier. In fact, and I know I say this a lot, but it's true, but I don't know where I would be withou tyour words of wisdom and all the advice you've given me this year. Through all the constant roasts, last minute hangouts, you having to explain comic book logic to me because I'm dumb, and your group roasts on me on Facebook (please stop), I'm so thankful to know that you my best interests at heart. You've been an amazing friend this year, and even though we may not fulfill JEVA CHIP, (rather you trying to pick from th eliteral swarm of girls you have while I'm alone af), I hope for many more memories (and less drama and issues) next year. I'm here for you and you that, and it comforts me to know that you'll always be here for me too (I hope). Love you long time ed, wo ai ni de bu de liao"
 },
 {
 "id":92,
 "name":"Allo Chat Shikaar Maharaj 1",
 "quote":"Aww, Ed! I'm so truly grateful to have you in my life. Honestly, you're the only person who I can truly talk to and be my true self with. I really love you ed! I mean that from the bottom of my heart. I promise, that no matter how much distance separates us or whatever stand sin our way, I'll always, ALWAYS be there for you. You've helped me through so much, and you're a big reason why I'm still in HK and I didn't give up n go back to SA. You're the one person I can trust to ever bring me back if I lose myself, and I never want to lose you ed.\nThanks for giving me a great year, and I hope we can make more amazing memories in 2017."
 },
 {
 "id":93,
 "name":"Snapchat Chat Cosima Lesca 1",
 "quote":"Awww love you <3 <3 <3 completely serious about the college updates can't wait to hear how you are doing.. also if you ever need/want to talk just snap me and we can Skype or snap call!! :) <3"
 },
 {
 "id":94,
 "name":"Snapchat Chat Katelyn Liu 1",
 "quote":"HOLY FUCK I LOVE U holy fuck you're actually incredible that made me smile so hard."
 },
 {
 "id":95,
 "name":"WhatsApp Chat Christine Lee 1",
 "quote":"Hey big bro! <3 \nI know it's been hard for you because you got sick and other things in your life. Even though I haven't been your baby sis for long, I wanted to say thank you for being my big bro. During interim, you were the one that I could go to if I had trouble. You have already done so so so so much for me that idk what I would do without you in my life. Whenever I think about how hard my life is, I always think of breaking down and I always go to you because you always somehow manage to talk me out of whatever I want to do to myself. I'm really happy that you are my big bro because I can go to you for advice or just general help. I wish you were my actual big bro sometimes because you treat me so well. I always wonder what life would be like if I died... I always wondered if my friends would miss me or be sad and then forget me... you have taught me so much already and I can't thank you enough. I don't mind the long passages because I feel like you are the only one who understands me and how I feel. I hope you get better big bro!! Love you so much!! <3 <3"
 },
 {
 "id":96,
 "name":"WhatsApp Chat Christine Lee 2",
 "quote":"Actually crying right now\nYou've been there for me since basically day one and ever since then, you've cheered me on more than anyone. Even you were busy, you still made sure to get to me and make sure I was doing okay <3 <3\n....\nthis might not happen to everyone but I am definitely afraid of the unknown. One way that I've dealt with it is just to breathe (just as you taught me) and let it happen. Sometimes the outcome is great and sometimes it's not. I believe everything happens for a reason and so don't be afraid <3 <3 \n...\nawww you've helped me so much and taught me so many things. One of them being to always breathe and slow down. I know my advice sucks sometimes (sometimes being most of the time) but to the people that I care about most, I try my ěry best to help back <3 Looking back at my journey and the people who helped me come out of my shell, you are definitely the person at the top of the list <3 <3 I've always focused on the negatives but you helped me to see the positives (even though sometimes there are no positives), you pushed me to try and find them. You don't get the credit you deserve which is sad because you've helped countless people"
 },
 {
 "id":97,
 "name":"Christine Lee Note 1",
 "quote":"Dear Edward aka My Counsellor aka my big bro <3, \nI'm so lucky to call you my big bro! You have been there for me since day 1! (Since I was 6 or 7?) Whenever I was feeling shitty, (which is pretty much every day), you always made sure to double-check on me. (Even if you were super busy). You always manage to see the best in me even when I can't see it myself. Tbh, I have no idea what I'm gonna do in the future without you? You've alway sbeen so supportive of everything(and tbh, idk how you do o it). Thanks for listening and dealing with my banter/rants! I know it's hard to deal with me but you make it work! You've always made me feel like I'm / my life iworth living (and I'm lowkey crying right now). I'm glad, wait no... grateful as shit that you were on my first Interim <3 We've been close for about two years and we already have so many memories <3 You already encourage me enough by speaking, but when you text it/ take the extra time, it lowkey makes me cry everytime. This is gonna be it for now, you'll get another one of these (maybe longer) when you graduate! Love you <3 \n love, \n lil sis <3"
 },
 {
 "id":98,
 "name":"Interim Note from Ms. Chi",
 "quote":"This interim would not have been the same without you. It certainly would not have been as successful as it was without you. Thank you for putting all of your heart and effort into making this an amazing experience for everyone who participated. You stepped up every day and everyone walked away feeling cared for, listened to, and valued. It's not easy to lead like this but you have a natural way of doing it, so I hope that you will find opportunities to continue in the future.\n\nI couldn't believe how hard everyone worked throughout the entire week! You were doing every task, encouraging everyone to work hard through your example and warm conversations. And of course you smile, which you wore throughout the week.\nI can't tell you how pleased I was to go on this experience with you and to see you blossom and help others blossom.\nYour aunt must be so proud to watch you do what you did.\nBest,\nMrs. Chi and Mr. Canham"
 }
]